app/Views/layout/user.php

SELECT COUNT(*) AS `numrows`
FROM `cart`
WHERE `id_order` IS NULL
---
                                    <i class="lni lni-cart"></i>
                                        <?php
                                            $cartModel = new App\Models\cartModel();
                                            $cartNull = $cartModel->where('id_order = ')->countAllResults();

SELECT *
FROM `cart`
JOIN `produk` ON `produk`.`id_produk` = `cart`.`id_produk`
WHERE `id_order` IS NULL
---
                                </button>
                                <ul class="dropdown-menu dropdown-menu-end" aria-labelledby="message">
                                    <?php
                                        $cartItem = $cartModel->cartProduk()->where('id_order = ')->find();