app/Controllers/admin.php

SELECT *
FROM `produk`
---
    public function stok()
    {
        $data = [
            'title' => 'Stok Produk',
            'produk' => $this->produkModel->findAll(),

SELECT *
FROM `stokis`
---
    public function stokis()
    {
        $data = [
            'title' => 'Stokis',
            'stokis' => $this->stokisModel->findAll()

SELECT *
FROM `produk`
---
    public function produk($id = "")
    {
        $produkDetail = $this->produkModel->find($id);

        $data = [
            'title' => 'Produk',
            'produk' => $this->produkModel->findAll(),