app/Controllers/Home.php

SELECT *
FROM `produk`
---
    public function index()
    {
        //Pencarian
        $keyword = $this->request->getVar('keyword');
        if (!$keyword) {
            // kalau tidak ada keyword tampilkan semua
            $produk = $this->produkModel->findAll();

SELECT *
FROM `produk`
WHERE `produk`.`id_produk` = '5'
SELECT *
FROM `stok`
JOIN `stokis` ON `stokis`.`id_stokis` = `stok`.`id_stokis`
WHERE `id_produk` = 5
SELECT *
FROM `produk`
 LIMIT 4
---
    public function detail($id)
    {
        $data = [
            'title' => 'Detail Produk',
            'produk' => $this->produkModel->find($id),
            'stok' => $this->stokModel->stokStokis()->where('id_produk = '.$id)->find(),
            'rekomendasi' => $this->produkModel->findAll(4),

SELECT *
FROM `cart`
JOIN `produk` ON `produk`.`id_produk` = `cart`.`id_produk`
WHERE `id_pembeli` = 1
AND `id_order` IS NULL
---
    public function keranjang()
    {
        $data = [
            'title' => 'Keranjang',
            'cart' => $this->cartModel->cartProduk()->where('id_pembeli ='.'1')->where('id_order = ')->find()

INSERT INTO `cart` (`id_produk`, `id_order`, `qty`, `subtotal`, `id_pembeli`) VALUES ('5', NULL, '1', '394000', 1)
---
    public function keranjangAdd()
    {
        $cart = [
            'id_produk' => $this->request->getVar('produk'),
            'id_order'  => NULL,
            'qty'       => $this->request->getVar('qty'),
            'subtotal'  => $this->request->getVar('harga'),
            'id_pembeli'=> 1
        ];

        $this->cartModel->save($cart);

INSERT INTO `order` (`id_pembeli`, `pembayaran`, `status`) VALUES (1, '', 0)
SELECT *
FROM `cart`
WHERE `id_pembeli` = 1
UPDATE `cart` SET `id_order` = 3
WHERE `cart`.`id_cart` IN ('1')
---
    public function orderAdd()
    {
        $order = [
            'id_pembeli'    => 1,
            'pembayaran'    => $this->request->getVar("payment"),
            'status'        => 0, //0 lunas 1 belum lunas
        ];

        $this->orderModel->insert($order);

        // update cart
        $cart = $this->cartModel->where('id_pembeli ='.'1')->find();

        foreach ($cart as $ID) {
            $cartUpdate = [
                'id_cart'      => $ID['id_cart'],
                'id_order'     => $this->orderModel->getInsertID()
            ];

            $this->cartModel->save($cartUpdate);